Revit 2024 API
DocumentOpeningEventArgs.PathName Property
 Path of the document to be opened.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2010
Syntax
C#
public string PathName { get; }
Visual Basic
Public ReadOnly Property PathName As String
	Get
Visual C++
public:
property String^ PathName {
	String^ get ();
}
See Also
DocumentOpeningEventArgs Class
Autodesk.Revit.DB.Events Namespace